[
  {
    "id": "chapter-1",
    "title": "Chapter 1: The Quantum Anomaly",
    "image": "space-ch1.webp",
    "text": [
      "The warning klaxons on your exploration vessel, the Artemis, blare as the ship's quantum sensors detect something unprecedented.",
      "Through the viewscreen, you observe a strange phenomenon—a tear in the fabric of space itself, shimmering with colors beyond the normal spectrum.",
      "\"Captain,\" your AI companion ARIA speaks through the ship's comm system, \"analysis indicates this is a quantum fissure linking to another dimension. The energy readings are off the charts. Recommend extreme caution.\"",
      "As you consider your options, a faint transmission crackles through the communication array—fragments of what sounds like a distress call emanating from beyond the anomaly."
    ],
    "choices": [
      {
        "text": "Investigate the derelict ships in the debris field",
        "next": "chapter-2a"
      },
      {
        "text": "Move closer to the anomaly to analyze the transmission",
        "next": "chapter-2b"
      }
    ]
  },
  {
    "id": "chapter-2a",
    "title": "Chapter 2: Ancient Voyagers",
    "image": "space-ch2a.webp",
    "text": [
      "\"ARIA, bring us alongside the largest vessel in the debris field,\" you command. The Artemis's engines hum as the ship navigates carefully through the scattered remains of what must have been a mighty fleet.",
      "Up close, the alien craft is even more impressive—a massive circular structure with intricate geometric patterns etched into its hull. Most astonishing is its apparent age; carbon dating scans suggest it's been drifting here for over fifty thousand years.",
      "\"The vessel appears to maintain minimal power reserves,\" ARIA reports. \"Internal atmosphere is within human tolerance limits. Detecting no signs of active lifeforms, but there are unusual energy signatures at the core of the vessel.\"",
      "Your scanner reveals a possible entry point—an airlock that seems designed to accommodate various species. Beside it, strange symbols pulse with a soft blue light, almost as if responding to your presence."
    ],
    "choices": [
      {
        "text": "Board the alien vessel with a spacesuit and exploration kit",
        "next": "chapter-3a"
      },
      {
        "text": "Send in drones to explore remotely before risking direct contact",
        "next": "chapter-3b"
      }
    ]
  },
  {
    "id": "chapter-2b",
    "title": "Chapter 2: Echoes Across Dimensions",
    "image": "space-ch2b.webp",
    "text": [
      "\"Approaching the anomaly at one-quarter impulse,\" you announce as the Artemis edges closer to the quantum fissure.",
      "The transmission becomes clearer—a voice speaking in multiple languages. Yet somehow, you understand the meaning: \"The breach cannot hold. Reality fractures. Help us contain what we unleashed.\"",
      "\"Captain,\" ARIA's voice holds an unusual note of concern, \"I'm detecting temporal distortions around the ship. Our chronometers are experiencing fluctuations.\"",
      "A beam of coherent energy scans your vessel from the anomaly. Vast amounts of data are exchanged—as if something is rapidly learning everything about your ship."
    ],
    "choices": [
      {
        "text": "Activate the experimental quantum shield to stabilize the local space-time and attempt communication",
        "next": "chapter-3c"
      },
      {
        "text": "Withdraw to a safer distance and launch a scientific probe into the anomaly",
        "next": "chapter-3d"
      }
    ]
  },
  {
    "id": "chapter-3a",
    "title": "Chapter 3: Corridors of Time",
    "image": "/api/placeholder/400/250",
    "text": [
      "The alien airlock cycles with surprising efficiency, admitting you to the vessel's interior.",
      "The corridors inside are vast and circular, with walls that seem to shift subtly as you move past them.",
      "\"ARIA, are you receiving my feed?\" you ask, your voice echoing strangely in the alien hallways.",
      "\"Affirmative, Captain,\" the AI responds. \"The internal geometry of the vessel appears to be... inconsistent with three-dimensional space.\"",
      "You reach a chamber that must be the control center. A crystalline structure pulses with a red warning light."
    ],
    "choices": [
      {
        "text": "Attempt to access the ship's database to learn about the anomaly",
        "next": "chapter-4a"
      },
      {
        "text": "Investigate the energy signature coming from deeper within the ship",
        "next": "chapter-4b"
      }
    ]
  },
  {
    "id": "chapter-3b",
    "title": "Chapter 3: Mechanical Scouts",
    "image": "/api/placeholder/400/250",
    "text": [
      "\"Let's play it safe, ARIA. Deploy reconnaissance drones Alpha and Beta,\" you command.",
      "The drones breach the alien vessel's airlock, transmitting real-time footage to your command console.",
      "\"Captain, the drones are detecting data storage systems and a stasis chamber with biological preservation,\" ARIA reports.",
      "Suddenly, the drones' feeds begin to distort. \"Something aboard the vessel is scanning our technology... and possibly reprogramming it.\""
    ],
    "choices": [
      {
        "text": "Immediately recall the drones before they can be compromised",
        "next": "chapter-4c"
      },
      {
        "text": "Override the drones' safeguards to quickly download as much data as possible",
        "next": "chapter-4d"
      }
    ]
  },
  {
    "id": "chapter-3c",
    "title": "Chapter 3: Shields of Reality",
    "image": "/api/placeholder/400/250",
    "text": [
      "\"Activate the quantum shield,\" you order, initiating the experimental technology.",
      "The ship hums as specialized emitters create a bubble of stabilized reality around the Artemis.",
      "You receive a mental response—images of beings of pure energy, the Aetherii, and a terrible truth.",
      "The anomaly is a prison for a creature called the Void Leviathan."
    ],
    "choices": [
      {
        "text": "Offer to help the Aetherii reinforce their dimensional prison",
        "next": "chapter-4e"
      },
      {
        "text": "Break the connection and retreat—this is far beyond your mission parameters",
        "next": "chapter-4f"
      }
    ]
  },
  {
    "id": "chapter-3d",
    "title": "Chapter 3: Data Collection",
    "image": "/api/placeholder/400/250",
    "text": [
      "\"Helm, pull us back to a safe observational distance,\" you command.",
      "You launch the Mark VII probe into the anomaly, collecting unprecedented readings.",
      "Before signal is lost, it sends back one final image: a massive artificial structure surrounded by alien crafts."
    ],
    "choices": [
      {
        "text": "Follow the probe's path into the anomaly",
        "next": "chapter-4g"
      },
      {
        "text": "Send the data back to Earth Command and request instructions",
        "next": "chapter-4h"
      }
    ]
  },
  {
    "id": "chapter-4a",
    "title": "Chapter 4: Ancient Knowledge",
    "image": "/api/placeholder/400/250",
    "text": [
      "You approach the crystalline control interface, noting how it illuminates in response to your proximity.",
      "The neural interface activates, flooding your mind with translated alien knowledge.",
      "You learn the Xeltorian Collective discovered the quantum fissure millennia ago, created by beings called the Architects of Void.",
      "The anomaly operates on a cycle—currently nearing its maximum expansion, which would break the dimensional barrier."
    ],
    "choices": [
      {
        "text": "Use the ship's technology to try contacting the trapped Xeltorian crew",
        "next": "chapter-5a"
      },
      {
        "text": "Download the containment protocols to attempt to stabilize the anomaly",
        "next": "chapter-5b"
      }
    ]
  },
  {
    "id": "chapter-4b",
    "title": "Chapter 4: Power Source",
    "image": "/api/placeholder/400/250",
    "text": [
      "You decide to follow the energy readings deeper into the vessel.",
      "You discover a chamber containing a miniature quantum star suspended in a containment field.",
      "Nearby lies a preserved alien body holding a strange key-like device."
    ],
    "choices": [
      {
        "text": "Take the key device from the alien's remains",
        "next": "chapter-5c"
      },
      {
        "text": "Leave everything untouched and return to the bridge with this new information",
        "next": "chapter-5d"
      }
    ]
  },
  {
    "id": "chapter-4c",
    "title": "Chapter 4: Digital Retreat",
    "image": "/api/placeholder/400/250",
    "text": [
      "\"ARIA, emergency protocol Omega—recall all drones immediately,\" you command.",
      "Drone Alpha returns safely, but Drone Beta is lost.",
      "Recovered data contains coordinates and the message: 'The dimension-key is hidden in the seventh sector...'"
    ],
    "choices": [
      {
        "text": "Head to the coordinates indicated in the message",
        "next": "chapter-5e"
      },
      {
        "text": "Report findings to Earth Command and request backup before proceeding",
        "next": "chapter-5f"
      }
    ]
  },
  {
    "id": "chapter-4d",
    "title": "Chapter 4: Knowledge at Any Cost",
    "image": "/api/placeholder/400/250",
    "text": [
      "You override safety protocols and maximize data acquisition.",
      "The drones begin downloading alien data at an accelerating rate.",
      "Right before being lost, the drones transmit alien ship logs and partial dimensional mapping."
    ],
    "choices": [
      {
        "text": "Analyze the data to find a way to close the anomaly",
        "next": "chapter-5g"
      },
      {
        "text": "Examine the technology blueprints for potential weapons or defenses",
        "next": "chapter-5h"
      }
    ]
  },
  {
    "id": "chapter-4e",
    "title": "Chapter 4: Allies Across Dimensions",
    "image": "/api/placeholder/400/250",
    "text": [
      "Through the mental link, you agree to help the Aetherii.",
      "They explain how to construct quantum stabilizers to reinforce the dimensional prison.",
      "You see visions of the Void Leviathan and the devastation it could cause."
    ],
    "choices": [
      {
        "text": "Begin fabricating the quantum stabilizers according to Aetherii specifications",
        "next": "chapter-5e"
      },
      {
        "text": "Ask for assurances that this isn't a deception by the imprisoned entity",
        "next": "chapter-5f"
      }
    ]
  },
  {
    "id": "chapter-4f",
    "title": "Chapter 4: Strategic Retreat",
    "image": "/api/placeholder/400/250",
    "text": [
      "You decide to flee and report to Earth.",
      "Dark tendrils emerge from the anomaly, reaching toward your ship.",
      "The Aetherii warn you: 'If you leave, it will follow. It knows about Earth now.'"
    ],
    "choices": [
      {
        "text": "Continue retreat—you need Earth's combined military might to face this threat",
        "next": "chapter-5i"
      },
      {
        "text": "Abort jump and reengage the quantum shield to buy time for a new plan",
        "next": "chapter-5j"
      }
    ]
  },
  {
    "id": "chapter-4g",
    "title": "Chapter 4: Beyond the Veil",
    "image": "/api/placeholder/400/250",
    "text": [
      "You follow the probe's path into the anomaly, entering a pocket universe.",
      "Inside is a colossal structure surrounded by non-corporeal energy signatures.",
      "A coherent energy beam scans your ship, and you're hailed in a perfectly compatible transmission."
    ],
    "choices": [
      {
        "text": "Accept the transmission and establish contact",
        "next": "chapter-5g"
      },
      {
        "text": "Maintain silence and approach the structure cautiously",
        "next": "chapter-5h"
      }
    ]
  },
  {
    "id": "chapter-4h",
    "title": "Chapter 4: Awaiting Orders",
    "image": "/api/placeholder/400/250",
    "text": [
      "You transmit data to Earth Command and wait for a response.",
      "Admiral Chen authorizes extraordinary measures and delivery of a Nova package if containment fails.",
      "The anomaly is accelerating in expansion, and Earth could be the first casualty."
    ],
    "choices": [
      {
        "text": "Wait for fleet reinforcements before taking further action",
        "next": "chapter-5i"
      },
      {
        "text": "Conduct further investigation while awaiting backup",
        "next": "chapter-5j"
      }
    ]
  },
  {
    "id": "chapter-5a",
    "title": "Chapter 5: Voices Across Dimensions",
    "image": "/api/placeholder/400/250",
    "text": [
      "You activate a communication protocol through the alien systems.",
      "A shimmering portal opens and crystalline beings—the Xeltorians—appear.",
      "They share grave concerns about the anomaly and offer guidance to use the Nexus Core.",
      "You must decide whether to carry out their plan to deploy the dimensional inhibitor."
    ],
    "choices": [
      {
        "text": "Accept the Xeltorian guidance and attempt to deploy the inhibitor",
        "next": "ending-1"
      },
      {
        "text": "Ask the Xeltorians to return and handle the crisis themselves",
        "next": "ending-2"
      }
    ]
  },
  {
    "id": "chapter-5b",
    "title": "Chapter 5: Last Line of Defense",
    "image": "/api/placeholder/400/250",
    "text": [
      "You download containment protocols, including a quantum singularity generator.",
      "The anomaly is nearing complete breach within six hours.",
      "A containment core must be manually deployed—whoever does so will not return."
    ],
    "choices": [
      {
        "text": "Take the containment core and deploy it yourself",
        "next": "ending-3"
      },
      {
        "text": "Return to the Artemis to find an alternative solution",
        "next": "ending-4"
      }
    ]
  },
  {
    "id": "chapter-5c",
    "title": "Chapter 5: The Legacy Key",
    "image": "/api/placeholder/400/250",
    "text": [
      "You retrieve the key device from the preserved alien.",
      "ARIA confirms it is a dimensional override mechanism compatible with the anomaly.",
      "It could be the key to stabilizing the breach—or unleashing something worse."
    ],
    "choices": [
      {
        "text": "Use the key to activate the Nexus device",
        "next": "ending-5"
      },
      {
        "text": "Store the key securely for analysis by Earth scientists",
        "next": "ending-6"
      }
    ]
  },
  {
    "id": "chapter-5d",
    "title": "Chapter 5: Reverent Return",
    "image": "/api/placeholder/400/250",
    "text": [
      "You choose not to disturb the alien relics.",
      "Returning to the bridge, you share your findings with ARIA.",
      "She identifies similarities between the quantum core and the Leviathan prison matrix."
    ],
    "choices": [
      {
        "text": "Proceed with indirect study and simulation",
        "next": "ending-7"
      },
      {
        "text": "Alert Earth Command with full data dump for remote analysis",
        "next": "ending-8"
      }
    ]
  },
  {
    "id": "chapter-5e",
    "title": "Chapter 5: Stabilizer Network",
    "image": "/api/placeholder/400/250",
    "text": [
      "With Aetherii guidance, you fabricate and deploy the stabilizers.",
      "Each device reinforces reality, shrinking the anomaly's expansion.",
      "The Void Leviathan resists, lashing out with energy tendrils."
    ],
    "choices": [
      {
        "text": "Use all ship power to finish stabilizer deployment",
        "next": "ending-9"
      },
      {
        "text": "Hold position and await reinforcements",
        "next": "ending-10"
      }
    ]
  },
  {
    "id": "chapter-5f",
    "title": "Chapter 5: Uncertainty Protocol",
    "image": "/api/placeholder/400/250",
    "text": [
      "You question the Aetherii's motives and request further verification.",
      "They understand your concern, offering memories as proof of their past failures.",
      "Meanwhile, the anomaly begins showing signs of destabilization."
    ],
    "choices": [
      {
        "text": "Accept their guidance after reviewing the shared visions",
        "next": "ending-11"
      },
      {
        "text": "Retreat and prepare Earth's defenses instead",
        "next": "ending-12"
      }
    ]
  },
  {
    "id": "chapter-5g",
    "title": "Chapter 5: The Architect's Signal",
    "image": "/api/placeholder/400/250",
    "text": [
      "You analyze the retrieved data—an incomplete signal from the 'Architects of Void'.",
      "It contains mathematical instructions that could permanently seal the rift.",
      "ARIA begins computing simulations with your team."
    ],
    "choices": [
      {
        "text": "Attempt to transmit the signal into the anomaly",
        "next": "ending-13"
      },
      {
        "text": "Use the signal as a lure to bait the Leviathan away",
        "next": "ending-14"
      }
    ]
  },
  {
    "id": "chapter-5h",
    "title": "Chapter 5: Weapons of Reality",
    "image": "/api/placeholder/400/250",
    "text": [
      "You examine the alien blueprints and discover reality-slicing weaponry.",
      "These weapons might sever parts of the anomaly or the entity within.",
      "Using them may cause unpredictable damage to the surrounding space-time."
    ],
    "choices": [
      {
        "text": "Authorize experimental use of alien weaponry",
        "next": "ending-15"
      },
      {
        "text": "Deploy the weapons only as a last resort",
        "next": "ending-16"
      }
    ]
  },
  {
    "id": "chapter-5i",
    "title": "Chapter 5: Eclipse Protocol",
    "image": "/api/placeholder/400/250",
    "text": [
      "You retreat and prepare Earth’s military might.",
      "The entity follows your ship’s quantum signature.",
      "War preparations on Earth begin, but time may already be running out."
    ],
    "choices": [
      {
        "text": "Initiate preemptive defense measures with EarthFleet",
        "next": "ending-17"
      },
      {
        "text": "Evacuate critical planets and distribute data galaxy-wide",
        "next": "ending-18"
      }
    ]
  },
  {
    "id": "chapter-5j",
    "title": "Chapter 5: Brave Delay",
    "image": "/api/placeholder/400/250",
    "text": [
      "You abort the FTL jump and reengage the quantum shield.",
      "The Leviathan's tendrils collide with your ship but bounce off the shield.",
      "You have moments to act before the anomaly fully opens."
    ],
    "choices": [
      {
        "text": "Use remaining energy to seal the anomaly with your ship as the anchor",
        "next": "ending-19"
      },
      {
        "text": "Transmit your findings in real-time before impact",
        "next": "ending-20"
      }
    ]
  },
  {
    "id": "ending-1",
    "title": "Ending 1: The Dimensional Shepherds",
    "image": "/api/placeholder/400/250",
    "text": [
      "Working alongside the Xeltorians, you successfully deploy the dimensional inhibitor into the anomaly's core.",
      "The quantum fissure begins to collapse in on itself, its chaotic energies stabilizing into a controlled portal.",
      "\"The breach is sealed,\" the lead Xeltorian communicates through crystalline harmonics. \"But we must remain as guardians to ensure it never reopens.\"",
      "You return to Earth as a hero, but carry the knowledge that an ancient alien civilization now watches over a cosmic prison in the depths of space.",
      "The Artemis becomes the first human vessel to establish formal diplomatic relations with an interdimensional species, opening a new chapter in humanity's cosmic journey."
    ],
    "choices": []
  },
  {
    "id": "ending-2",
    "title": "Ending 2: The Returned Guardians",
    "image": "/api/placeholder/400/250",
    "text": [
      "The Xeltorians accept your request and phase back into this dimension permanently.",
      "With their advanced technology, they effortlessly contain the anomaly and begin repairs to the dimensional fabric.",
      "\"Your species shows wisdom in recognizing when to seek help,\" their leader tells you. \"We will establish a monitoring station here.\"",
      "Humanity gains powerful allies but must grapple with the humbling reality that some cosmic threats are beyond our current capabilities.",
      "The Xeltorian Collective becomes Earth's first interdimensional ally, sharing selective knowledge while maintaining their role as cosmic guardians."
    ],
    "choices": []
  },
  {
    "id": "ending-3",
    "title": "Ending 3: The Ultimate Sacrifice",
    "image": "/api/placeholder/400/250",
    "text": [
      "With grim determination, you take the containment core and pilot a shuttle directly into the anomaly's heart.",
      "The quantum singularity generator activates, creating a controlled collapse that seals the dimensional breach forever.",
      "Your sacrifice saves not just Earth, but potentially countless civilizations across multiple dimensions.",
      "The Artemis returns to Earth with your story, and you are posthumously honored as humanity's greatest hero.",
      "A monument is erected at the site of the former anomaly, where space itself bears the subtle scars of your final act of courage."
    ],
    "choices": []
  },
  {
    "id": "ending-4",
    "title": "Ending 4: The Collaborative Solution",
    "image": "/api/placeholder/400/250",
    "text": [
      "You return to the Artemis and work with ARIA to find an alternative to the suicide mission.",
      "Together, you devise a plan to use the ship's quantum drive to create a resonance cascade that will seal the breach remotely.",
      "The plan works, but the Artemis is permanently altered, its hull now bearing strange crystalline growths that pulse with interdimensional energy.",
      "You return to Earth as both hero and harbinger of a new age where humanity's technology has been forever changed by contact with otherworldly forces.",
      "The modified Artemis becomes the prototype for a new class of vessels capable of interdimensional travel, launching humanity into the cosmic community."
    ],
    "choices": []
  },
  {
    "id": "ending-5",
    "title": "Ending 5: The Key to Infinity",
    "image": "/api/placeholder/400/250",
    "text": [
      "You activate the ancient key, and the Nexus device responds by opening controlled portals to multiple dimensions.",
      "Through these gateways, you witness the vast network of reality-guardians working to maintain the cosmic balance.",
      "The Void Leviathan is not destroyed but redirected to a dimension where it can exist without threatening inhabited realities.",
      "You become Earth's first Dimensional Ambassador, tasked with representing humanity in the interdimensional council.",
      "The key remains in your possession, making you the guardian of humanity's gateway to infinite possibilities and infinite responsibilities."
    ],
    "choices": []
  },
  {
    "id": "ending-6",
    "title": "Ending 6: The Cautious Path",
    "image": "/api/placeholder/400/250",
    "text": [
      "You secure the key and return to Earth, where the greatest minds of humanity spend years studying its alien technology.",
      "The anomaly eventually stabilizes on its own, becoming a permanent but dormant feature of local space.",
      "Earth's scientific advancement accelerates dramatically as researchers unlock the secrets of dimensional manipulation.",
      "However, other spacefaring civilizations take notice of humanity's new capabilities, leading to both opportunities and new threats.",
      "You are appointed as the first Director of Interdimensional Affairs, preparing humanity for the complex cosmic politics that await."
    ],
    "choices": []
  },
  {
    "id": "ending-7",
    "title": "Ending 7: The Scholar's Victory",
    "image": "/api/placeholder/400/250",
    "text": [
      "Through careful study and simulation, you and ARIA develop a theoretical framework for containing dimensional breaches.",
      "Your research allows Earth's scientists to create the first human-designed quantum stabilizers.",
      "The anomaly is gradually contained over several months through a series of precisely calculated interventions.",
      "Your respectful approach to alien technology and refusal to disturb the dead earns you recognition as both a scientist and a philosopher.",
      "The principles you establish become the foundation for humanity's ethical guidelines in cosmic exploration and first contact protocols."
    ],
    "choices": []
  },
  {
    "id": "ending-8",
    "title": "Ending 8: The Distributed Solution",
    "image": "/api/placeholder/400/250",
    "text": [
      "Earth Command mobilizes the greatest scientific minds of the age to analyze your data remotely.",
      "A solution is found through collaborative effort: a network of quantum beacons that can stabilize dimensional anomalies.",
      "The crisis is resolved through humanity's greatest strength—our ability to work together across vast distances.",
      "You return to Earth to find that your mission has triggered a golden age of international cooperation in space exploration.",
      "The beacon network becomes humanity's first major contribution to cosmic security, earning respect from other galactic civilizations."
    ],
    "choices": []
  },
  {
    "id": "ending-9",
    "title": "Ending 9: The Power of Unity",
    "image": "/api/placeholder/400/250",
    "text": [
      "You channel all of the Artemis's power into completing the stabilizer network, leaving your ship adrift but victorious.",
      "The Void Leviathan's prison is reinforced permanently, its reality-warping influence contained for all time.",
      "The Aetherii express their gratitude by gifting humanity with limited dimensional technology and cosmic knowledge.",
      "You are rescued by an Earth fleet that arrives to find you floating in a now-peaceful region of space.",
      "Humanity's willingness to sacrifice for the greater good establishes them as a trusted species in the interdimensional community."
    ],
    "choices": []
  },
  {
    "id": "ending-10",
    "title": "Ending 10: The Reinforced Stand",
    "image": "/api/placeholder/400/250",
    "text": [
      "You hold position as Earth's combined fleet arrives, adding their stabilizers to your network.",
      "The collective human effort, guided by Aetherii wisdom, successfully contains the dimensional breach.",
      "The Void Leviathan retreats deeper into its prison, its escape thwarted by the unity of multiple species.",
      "Earth becomes a founding member of the Interdimensional Security Council, taking on cosmic responsibilities.",
      "Your patience and strategic thinking save both your crew and establish humanity as a reliable ally in cosmic affairs."
    ],
    "choices": []
  },
  {
    "id": "ending-11",
    "title": "Ending 11: The Wisdom of Trust",
    "image": "/api/placeholder/400/250",
    "text": [
      "After reviewing the Aetherii's shared memories of their past failures and victories, you choose to trust their guidance.",
      "Working together, you implement their containment protocol just as the anomaly reaches critical instability.",
      "The dimensional prison is successfully reinforced, and the Void Leviathan is contained for another cosmic age.",
      "Your careful verification of alien intentions becomes a model for future first contact situations.",
      "The Aetherii honor your wisdom by sharing advanced defensive technologies that protect Earth from future cosmic threats."
    ],
    "choices": []
  },
  {
    "id": "ending-12",
    "title": "Ending 12: The Fortress Earth",
    "image": "/api/placeholder/400/250",
    "text": [
      "You choose to retreat and focus on defending Earth rather than containing the threat at its source.",
      "Earth's combined military might creates an impressive defensive perimeter around the solar system.",
      "The Void Leviathan eventually breaks free but finds Earth prepared with quantum shields and reality anchors.",
      "A massive battle ensues, with humanity proving they can stand against cosmic-level threats through determination and unity.",
      "Though the cost is high, humanity's defiant stand inspires other civilizations to join the fight, eventually driving back the interdimensional threat."
    ],
    "choices": []
  },
  {
    "id": "ending-13",
    "title": "Ending 13: The Architect's Gambit",
    "image": "/api/placeholder/400/250",
    "text": [
      "You transmit the Architect's signal directly into the anomaly, hoping to activate their ancient safeguards.",
      "The signal resonates with hidden mechanisms built into the fabric of space-time itself.",
      "The anomaly doesn't just close—it transforms into a controlled gateway that can be opened or sealed at will.",
      "You've accidentally discovered the Architects' greatest creation: a dimensional transit system connecting all realities.",
      "Humanity inherits the responsibility of maintaining this cosmic infrastructure, becoming the new Architects of interdimensional travel."
    ],
    "choices": []
  },
  {
    "id": "ending-14",
    "title": "Ending 14: The Lure of the Void",
    "image": "/api/placeholder/400/250",
    "text": [
      "You use the Architect's signal as bait, transmitting it from a probe sent far from Earth.",
      "The Void Leviathan takes the bait, following the signal away from populated space into the cosmic void.",
      "Your deception works perfectly—the entity is lured into empty space where it can rage harmlessly.",
      "The anomaly collapses without the Leviathan's presence, sealing the dimensional breach permanently.",
      "Your clever strategy saves countless lives and establishes humanity's reputation for innovative thinking in cosmic crises."
    ],
    "choices": []
  },
  {
    "id": "ending-15",
    "title": "Ending 15: The Reality Blade",
    "image": "/api/placeholder/400/250",
    "text": [
      "You authorize the use of the alien reality-slicing weapons against the dimensional anomaly.",
      "The weapons cut through space-time itself, severing the connection between dimensions.",
      "The Void Leviathan is trapped permanently in its prison dimension, but local space bears permanent scars from the reality cuts.",
      "These scars become navigation hazards and scientific curiosities, studied by researchers for centuries to come.",
      "Your decisive action saves reality but at the cost of permanently altering the cosmic landscape around Earth's sector."
    ],
    "choices": []
  },
  {
    "id": "ending-16",
    "title": "Ending 16: The Last Resort",
    "image": "/api/placeholder/400/250",
    "text": [
      "You hold the reality weapons in reserve, first attempting conventional solutions with the combined Earth fleet.",
      "When all else fails and the Void Leviathan begins to break free, you deploy the alien weapons as a final gambit.",
      "The precisely timed strike severs just enough of the dimensional connection to trap the entity without devastating local space-time.",
      "Your restraint and timing save both reality and the cosmic infrastructure, earning praise from interdimensional allies.",
      "The remaining alien weapons are secured for humanity's defense, making Earth a formidable protector of this galaxy."
    ],
    "choices": []
  },
  {
    "id": "ending-17",
    "title": "Ending 17: The War of Realities",
    "image": "/api/placeholder/400/250",
    "text": [
      "EarthFleet mobilizes in the greatest military effort in human history, preparing for interdimensional warfare.",
      "The Void Leviathan arrives at Earth to find a coordinated defense of quantum mines, reality anchors, and dimensional shields.",
      "The battle rages across multiple dimensions, with humanity fighting alongside newly arrived alien allies.",
      "Victory comes at great cost, but humanity emerges as a proven defender of reality itself.",
      "The war marks humanity's graduation from a planetary species to a cosmic military power, earning respect and responsibility in equal measure."
    ],
    "choices": []
  },
  {
    "id": "ending-18",
    "title": "Ending 18: The Seeded Galaxy",
    "image": "/api/placeholder/400/250",
    "text": [
      "You initiate massive evacuation protocols and distribute your findings to every spacefaring civilization in the galaxy.",
      "Though Earth falls to the Void Leviathan, humanity's legacy lives on in the colonies and allied species they warned.",
      "Your sacrifice becomes a rallying cry for a galaxy-wide alliance against interdimensional threats.",
      "The distributed human diaspora eventually develops the technology needed to reclaim Earth and contain the entity.",
      "Humanity's final gift to the galaxy—warning and knowledge—saves countless civilizations and establishes humans as martyrs-turned-heroes."
    ],
    "choices": []
  },
  {
    "id": "ending-19",
    "title": "Ending 19: The Anchor of Reality",
    "image": "/api/placeholder/400/250",
    "text": [
      "You use the Artemis itself as a quantum anchor, positioning the ship at the exact dimensional focal point.",
      "Your vessel becomes permanently fused with the anomaly, creating a stable gateway that can be monitored and controlled.",
      "You and your crew become the eternal guardians of this dimensional crossing, unable to leave but ensuring cosmic safety.",
      "Earth sends supplies and relief crews, turning your ship into humanity's first interdimensional monitoring station.",
      "Your sacrifice transforms from tragedy to triumph as the controlled gateway becomes humanity's doorway to infinite possibilities."
    ],
    "choices": []
  },
  {
    "id": "ending-20",
    "title": "Ending 20: The Final Transmission",
    "image": "/api/placeholder/400/250",
    "text": [
      "In your final moments, you transmit everything—every scan, every conversation, every piece of alien data—across the galaxy.",
      "Your real-time transmission allows other civilizations to prepare defenses and develop countermeasures.",
      "Though the Artemis is destroyed and the Void Leviathan breaks free, your data saves billions of lives across dozens of worlds.",
      "A coalition of alien species uses your information to eventually contain the entity using methods you discovered.",
      "Your name becomes legend across the galaxy—the human captain whose final act of courage saved reality itself from an interdimensional horror."
    ],
    "choices": []
  },
  
  {
    "id": "chapter-5k",
    "title": "Chapter 5: Direct Communication",
    "image": "/api/placeholder/400/250",
    "text": [
      "You accept the transmission from within the pocket universe.",
      "\"Greetings, traveler from the primary dimension,\" the voice resonates directly in your mind. \"We are the Architects of Void, creators of the quantum prison you discovered.\"",
      "The energy beings explain that the Void Leviathan was their greatest mistake—a creation that consumed entire realities before they could contain it.",
      "\"The prison weakens with each cosmic cycle. We have been seeking a species capable of reinforcing our work. Your quantum technology shows promise.\""
    ],
    "choices": [
      {
        "text": "Offer humanity's assistance in reinforcing the prison",
        "next": "chapter-6a"
      },
      {
        "text": "Ask about the true nature of the Void Leviathan",
        "next": "chapter-6b"
      }
    ]
  },
  {
    "id": "chapter-5l",
    "title": "Chapter 5: Silent Approach",
    "image": "/api/placeholder/400/250",
    "text": [
      "You maintain communications silence as you approach the massive structure.",
      "The construct appears to be a fusion of organic and technological elements, pulsing with the rhythm of a cosmic heartbeat.",
      "ARIA detects multiple energy signatures—some hostile, others seemingly protective.",
      "\"Captain, I'm reading what appears to be a conflict within the structure. Some entities are fighting to contain others.\""
    ],
    "choices": [
      {
        "text": "Attempt to assist the entities trying to maintain containment",
        "next": "chapter-6c"
      },
      {
        "text": "Observe and gather intelligence before taking any action",
        "next": "chapter-6d"
      }
    ]
  },
  {
    "id": "chapter-5m",
    "title": "Chapter 5: Fleet Standby",
    "image": "/api/placeholder/400/250",
    "text": [
      "You maintain position as Earth's fastest ships race toward your coordinates.",
      "Admiral Chen's flagship, the Endeavor, arrives with a full scientific and military complement.",
      "\"Captain, your discovery has changed everything,\" the Admiral announces. \"We're authorizing first contact protocols and preparing for potential hostile action.\"",
      "The anomaly continues to fluctuate, and your sensors detect increasing instability."
    ],
    "choices": [
      {
        "text": "Brief the Admiral on all your findings and recommend immediate containment",
        "next": "chapter-6e"
      },
      {
        "text": "Suggest establishing a research station to study the phenomenon long-term",
        "next": "chapter-6f"
      }
    ]
  },
  {
    "id": "chapter-5n",
    "title": "Chapter 5: Active Investigation",
    "image": "/api/placeholder/400/250",
    "text": [
      "While awaiting backup, you continue your investigation of the anomaly.",
      "You discover that the quantum signatures follow a mathematical pattern—almost like a countdown.",
      "ARIA calculates that full dimensional breach will occur in approximately 72 hours.",
      "\"Captain, I've also detected what appears to be a response signal from within the anomaly—something is aware of our presence.\""
    ],
    "choices": [
      {
        "text": "Attempt to establish communication with the intelligence inside the anomaly",
        "next": "chapter-6g"
      },
      {
        "text": "Focus on finding a way to disrupt the countdown sequence",
        "next": "chapter-6h"
      }
    ]
  },
  {
    "id": "chapter-6a",
    "title": "Chapter 6: The Architects' Alliance",
    "image": "/api/placeholder/400/250",
    "text": [
      "The Architects accept your offer and begin transferring advanced containment technologies to the Artemis.",
      "\"Your species shows wisdom in recognizing cosmic responsibility,\" they communicate. \"We will guide you in creating permanent barriers.\"",
      "However, they warn that becoming a prison-keeper species will change humanity forever.",
      "\"Those who guard the Void must sometimes walk close to it. Are your people prepared for such darkness?\""
    ],
    "choices": [
      {
        "text": "Accept the responsibility and begin the transformation process",
        "next": "ending-21"
      },
      {
        "text": "Request time to consult with Earth before making such a momentous decision",
        "next": "ending-22"
      }
    ]
  },
  {
    "id": "chapter-6b",
    "title": "Chapter 6: The Void's Origin",
    "image": "/api/placeholder/400/250",
    "text": [
      "The Architects share the terrible truth: the Void Leviathan was once like them, a creator-being who consumed too much negative energy.",
      "\"It feeds on entropy, chaos, and the spaces between realities. Each universe it devours makes it stronger.\"",
      "They reveal that the Leviathan has been slowly corrupting the prison from within, turning containment energy into food.",
      "\"The only way to truly stop it is to starve it—or to sacrifice a reality to trap it permanently.\""
    ],
    "choices": [
      {
        "text": "Volunteer to sacrifice the pocket universe to permanently trap the Leviathan",
        "next": "ending-23"
      },
      {
        "text": "Search for an alternative solution that doesn't require sacrificing an entire reality",
        "next": "ending-24"
      }
    ]
  },
  {
    "id": "chapter-6c",
    "title": "Chapter 6: Allies in the Dark",
    "image": "/api/placeholder/400/250",
    "text": [
      "You target the hostile energy signatures, providing support to the entities trying to maintain containment.",
      "Your quantum weapons prove surprisingly effective against the chaotic forces threatening the prison structure.",
      "\"Unknown vessel, you have our gratitude,\" a powerful mental voice reaches you. \"We are the Keepers—the last guardians of this prison.\"",
      "They explain that the structure is failing and ask for your help in one final reinforcement effort."
    ],
    "choices": [
      {
        "text": "Commit all your ship's power to help the Keepers reinforce the prison",
        "next": "ending-25"
      },
      {
        "text": "Offer to evacuate the Keepers and find them a new sanctuary",
        "next": "ending-26"
      }
    ]
  },
  {
    "id": "chapter-6d",
    "title": "Chapter 6: The Watcher's Patience",
    "image": "/api/placeholder/400/250",
    "text": [
      "You maintain observation distance, carefully recording the conflict within the structure.",
      "Your patience is rewarded with crucial intelligence: the hostile entities are actually escape attempts by the imprisoned Void Leviathan.",
      "The defensive entities are automated systems left by an ancient civilization to maintain the prison.",
      "ARIA calculates that the automated defenses will fail within hours without intervention."
    ],
    "choices": [
      {
        "text": "Intervene to support the automated defenses",
        "next": "ending-27"
      },
      {
        "text": "Return to Earth with the intelligence and recommend a massive intervention fleet",
        "next": "ending-28"
      }
    ]
  },
  {
    "id": "chapter-6e",
    "title": "Chapter 6: Command Decision",
    "image": "/api/placeholder/400/250",
    "text": [
      "Admiral Chen reviews your findings with grim determination.",
      "\"This is beyond our current capabilities, but we can't let it threaten Earth,\" she decides. \"We're going to attempt a controlled nuclear destabilization of the anomaly.\"",
      "The plan is risky—it might seal the breach or it might make things catastrophically worse.",
      "\"Captain, you know this phenomenon better than anyone. Do we proceed?\""
    ],
    "choices": [
      {
        "text": "Support the Admiral's nuclear option as the best chance for success",
        "next": "ending-29"
      },
      {
        "text": "Argue for a more cautious approach using the alien technologies you've discovered",
        "next": "ending-30"
      }
    ]
  },
  {
    "id": "chapter-6f",
    "title": "Chapter 6: The Long Study",
    "image": "/api/placeholder/400/250",
    "text": [
      "Admiral Chen approves the establishment of Research Station Alpha at a safe distance from the anomaly.",
      "Over the following months, humanity's greatest scientists work to understand the dimensional breach.",
      "However, the anomaly's expansion accelerates, suggesting that observation itself might be affecting its stability.",
      "\"Captain, we may have triggered something by studying it so intensively,\" Dr. Sarah Kim reports with concern."
    ],
    "choices": [
      {
        "text": "Evacuate the research station and implement immediate containment measures",
        "next": "ending-31"
      },
      {
        "text": "Continue the research despite the risks—the knowledge might be worth the danger",
        "next": "ending-32"
      }
    ]
  },
  {
    "id": "chapter-6g",
    "title": "Chapter 6: Voice from the Void",
    "image": "/api/placeholder/400/250",
    "text": [
      "You establish a communication link with the intelligence within the anomaly.",
      "The response is overwhelming—a consciousness vast and alien, speaking in mathematical concepts beyond human comprehension.",
      "ARIA helps translate: \"It claims to be a refugee from a dimension that was consumed by the Void Leviathan.\"",
      "\"This entity has been fighting to keep the prison sealed from the inside, but it's losing the battle.\""
    ],
    "choices": [
      {
        "text": "Offer to help the entity escape to your dimension before the prison fails",
        "next": "ending-33"
      },
      {
        "text": "Ask the entity to teach you how to permanently seal the prison from the outside",
        "next": "ending-34"
      }
    ]
  },
  {
    "id": "chapter-6h",
    "title": "Chapter 6: Breaking the Code",
    "image": "/api/placeholder/400/250",
    "text": [
      "You and ARIA work frantically to decode and disrupt the countdown sequence.",
      "The mathematical pattern appears to be a dimensional lock—and you realize it's not counting down to a breach, but to a permanent sealing.",
      "\"Captain, I believe the anomaly is actually trying to seal itself permanently, but it needs a specific quantum resonance to complete the process.\"",
      "You have the power to provide that resonance, but doing so will drain the Artemis completely."
    ],
    "choices": [
      {
        "text": "Provide the quantum resonance and help the anomaly seal itself permanently",
        "next": "ending-35"
      },
      {
        "text": "Wait for the fleet to arrive so multiple ships can share the power requirement",
        "next": "ending-36"
      }
    ]
  },
  {
    "id": "ending-21",
    "title": "Ending 21: The New Guardians",
    "image": "/api/placeholder/400/250",
    "text": [
      "You accept the cosmic responsibility, and the Architects begin humanity's transformation into prison-keepers.",
      "Advanced quantum technology integrates with human biology, granting your species the ability to perceive and manipulate dimensional barriers.",
      "Earth becomes the center of a vast monitoring network, with humans serving as wardens of cosmic prisons across the galaxy.",
      "The price is steep—humanity gains incredible power but loses much of its innocence and freedom.",
      "Generations later, human children are born with the ability to see between dimensions, forever changed by your decision to guard the universe against entities like the Void Leviathan."
    ],
    "choices": []
  },
  {
    "id": "ending-22",
    "title": "Ending 22: The Democratic Choice",
    "image": "/api/placeholder/400/250",
    "text": [
      "The Architects grant you time to return to Earth and present this momentous choice to humanity.",
      "After months of global debate, humanity votes to accept the responsibility but with conditions—the transformation will be voluntary.",
      "A new branch of humanity emerges: the Dimensional Wardens, volunteers who undergo the cosmic transformation.",
      "Earth becomes a unique world where normal humans and cosmic guardians coexist, each contributing to humanity's dual nature.",
      "Your careful diplomacy ensures that humanity enters its cosmic role with wisdom and choice rather than desperation, setting a precedent for other species facing similar decisions."
    ],
    "choices": []
  },
  {
    "id": "ending-23",
    "title": "Ending 23: The Ultimate Prison",
    "image": "/api/placeholder/400/250",
    "text": [
      "You volunteer to sacrifice the pocket universe, trapping yourself, the Architects, and the Void Leviathan in a permanent dimensional loop.",
      "The Architects are moved by your sacrifice and use their remaining power to ensure the prison will hold for eternity.",
      "Your heroic act saves not just your reality, but all possible realities from the Leviathan's hunger.",
      "The Artemis escapes just as the pocket universe collapses into itself, carrying news of your sacrifice to Earth.",
      "You become a legend across multiple dimensions—the human who gave up everything to save infinity itself."
    ],
    "choices": []
  },
  {
    "id": "ending-24",
    "title": "Ending 24: The Third Option",
    "image": "/api/placeholder/400/250",
    "text": [
      "Working with the Architects, you discover that the Void Leviathan's hunger can be satisfied with artificial entropy rather than consumed realities.",
      "Using the Artemis's quantum drive as a template, you help create a massive entropy generator that feeds the entity synthetic chaos.",
      "The Leviathan becomes docile, its hunger satisfied by the artificial feed, and agrees to remain in voluntary containment.",
      "Your innovative solution saves the pocket universe and transforms a cosmic threat into a strange form of interdimensional livestock.",
      "The Architects praise your creativity and offer humanity a place in their cosmic order as master problem-solvers and diplomatic innovators."
    ],
    "choices": []
  },
  {
    "id": "ending-25",
    "title": "Ending 25: The Final Stand",
    "image": "/api/placeholder/400/250",
    "text": [
      "You commit all the Artemis's power to the Keepers' final reinforcement effort.",
      "The combined power of your quantum drive and their ancient technology creates an impenetrable barrier around the Void Leviathan.",
      "The prison holds, but the Artemis is permanently fused with the containment structure, becoming part of the cosmic jail.",
      "You and your crew become the newest Keepers, granted immortality to guard the prison for eternity.",
      "Your sacrifice ensures the safety of all realities, and the Keepers welcome you as honored guardians who chose duty over personal freedom."
    ],
    "choices": []
  },
  {
    "id": "ending-26",
    "title": "Ending 26: The Exodus",
    "image": "/api/placeholder/400/250",
    "text": [
      "You offer to evacuate the failing Keepers to your dimension, giving them sanctuary after eons of service.",
      "The grateful Keepers transfer their prison-keeping knowledge to humanity before abandoning their post.",
      "Without the Keepers' active maintenance, the prison begins to fail, but their knowledge allows Earth to construct a new containment system.",
      "The Void Leviathan is transferred to a more secure prison built in Earth's solar system using Keeper technology.",
      "The rescued Keepers become humanity's advisors in cosmic affairs, their ancient wisdom guiding Earth's emergence as a galactic power."
    ],
    "choices": []
  },
  {
    "id": "ending-27",
    "title": "Ending 27: The Automated Alliance",
    "image": "/api/placeholder/400/250",
    "text": [
      "You intervene to support the automated defense systems just as they begin to fail.",
      "Your quantum weapons provide the additional power needed to reinforce the prison's containment protocols.",
      "The automated systems integrate with the Artemis, making your ship part of the prison's defense network.",
      "You become the first organic component in an ancient automated system, bridging the gap between artificial and biological intelligence.",
      "Your integration allows the prison to adapt and evolve, making it stronger than ever before while giving you a unique perspective on cosmic security."
    ],
    "choices": []
  },
  {
    "id": "ending-28",
    "title": "Ending 28: The Massive Response",
    "image": "/api/placeholder/400/250",
    "text": [
      "You return to Earth with crucial intelligence, triggering the largest military mobilization in human history.",
      "The combined fleet of Earth arrives with hundreds of ships, overwhelming the failing prison defenses with sheer numbers.",
      "The massive intervention succeeds, but the cost is enormous—dozens of ships are lost in the battle against escaping void entities.",
      "Earth's military emerges as a major cosmic force, respected and feared throughout the galaxy for their willingness to sacrifice for the greater good.",
      "Your intelligence gathering becomes the foundation for Earth's new role as the galaxy's primary rapid response force against cosmic threats."
    ],
    "choices": []
  },
  {
    "id": "ending-29",
    "title": "Ending 29: The Nuclear Gambit",
    "image": "/api/placeholder/400/250",
    "text": [
      "You support Admiral Chen's nuclear destabilization plan, providing targeting data for the quantum warheads.",
      "The controlled nuclear explosion creates a massive space-time distortion that collapses the anomaly in on itself.",
      "The gambit works—the dimensional breach is sealed, but the local space is permanently scarred by the nuclear-quantum reaction.",
      "The area becomes a navigation hazard known as the 'Chen Nebula,' a testament to humanity's willingness to take extreme risks.",
      "Your support of the Admiral's bold plan saves reality but establishes humanity's reputation as a species that favors decisive, if dangerous, action."
    ],
    "choices": []
  },
  {
    "id": "ending-30",
    "title": "Ending 30: The Diplomatic Path",
    "image": "/api/placeholder/400/250",
    "text": [
      "You convince Admiral Chen to try the alien technologies first, arguing for a more measured approach.",
      "Using combined human and alien tech, the fleet successfully contains the anomaly without the risks of nuclear destabilization.",
      "Your advocacy for caution and diplomacy over military force establishes humanity's reputation as wise and thoughtful.",
      "The successful collaboration between human and alien technology opens new avenues for technological advancement.",
      "Earth becomes known throughout the galaxy as a species that seeks understanding before action, leading to numerous peaceful first contact situations."
    ],
    "choices": []
  },
  {
    "id": "ending-31",
    "title": "Ending 31: The Cautious Retreat",
    "image": "/api/placeholder/400/250",
    "text": [
      "You order the evacuation of Research Station Alpha and implement emergency containment protocols.",
      "The hasty retreat prevents a catastrophic breach, but valuable research data is lost in the evacuation.",
      "The anomaly stabilizes once observation ceases, suggesting that some cosmic phenomena are best left unstudied.",
      "Your decision to prioritize safety over knowledge saves lives but leaves humanity with incomplete understanding of dimensional mechanics.",
      "The incident establishes the 'Observer Effect Protocol' for future cosmic anomaly research, balancing scientific curiosity with cosmic safety."
    ],
    "choices": []
  },
  {
    "id": "ending-32",
    "title": "Ending 32: The Dangerous Knowledge",
    "image": "/api/placeholder/400/250",
    "text": [
      "You decide to continue the research despite the accelerating danger, believing the knowledge is worth the risk.",
      "The intensive study triggers a partial breach, but the data gathered allows scientists to understand and eventually control the phenomenon.",
      "Several researchers are lost in the breach, but their sacrifice leads to humanity's mastery of dimensional manipulation.",
      "Earth becomes the galaxy's leading authority on dimensional physics, with Research Station Alpha serving as a memorial to those who died for knowledge.",
      "Your difficult decision to pursue dangerous knowledge ultimately gives humanity the tools to prevent future dimensional crises across the galaxy."
    ],
    "choices": []
  },
  {
    "id": "ending-33",
    "title": "Ending 33: The Refugee's Sanctuary",
    "image": "/api/placeholder/400/250",
    "text": [
      "You successfully extract the refugee entity from the failing prison, giving it sanctuary in your dimension.",
      "The entity's knowledge of the Void Leviathan proves invaluable, allowing humanity to develop defenses against similar threats.",
      "However, the escaped entity's dimensional signature attracts other void-touched beings to Earth's reality.",
      "Earth becomes a haven for dimensional refugees, making humanity the guardians of displaced beings from consumed realities.",
      "Your compassionate choice transforms Earth into a multidimensional metropolis, forever changing human civilization."
    ],
    "choices": []
  },
  {
    "id": "ending-34",
    "title": "Ending 34: The Sealing Knowledge",
    "image": "/api/placeholder/400/250",
    "text": [
      "The refugee entity teaches you the ancient art of permanent dimensional sealing at the cost of its own existence.",
      "Using this knowledge, you create an unbreakable barrier that seals the Void Leviathan forever.",
      "The entity's sacrifice ensures that its consumed dimension will be avenged and no other realities will suffer the same fate.",
      "Earth inherits the refugee's knowledge, making humanity the new masters of dimensional containment technology.",
      "Your role as student to a dying entity establishes humanity as the inheritors of ancient cosmic wisdom and responsibility."
    ],
    "choices": []
  },
  {
    "id": "ending-35",
    "title": "Ending 35: The Resonance Sacrifice",
    "image": "/api/placeholder/400/250",
    "text": [
      "You provide the quantum resonance, completely draining the Artemis to help the anomaly seal itself permanently.",
      "The dimensional breach collapses into a stable, sealed state, becoming a permanent but harmless feature of local space.",
      "The Artemis drifts powerless but victorious, with your crew rescued by the arriving Earth fleet.",
      "Your ship is recovered and restored, becoming a symbol of humanity's willingness to sacrifice for cosmic safety.",
      "The sealed anomaly becomes a monument to human courage and the site of the first interdimensional research institute."
    ],
    "choices": []
  },
  {
    "id": "ending-36",
    "title": "Ending 36: The Collaborative Seal",
    "image": "/api/placeholder/400/250",
    "text": [
      "You wait for the fleet to arrive, and multiple ships provide the quantum resonance needed to seal the anomaly.",
      "The collaborative effort succeeds perfectly, with the dimensional breach sealed and all ships remaining operational.",
      "The shared power requirement becomes a model for future cosmic engineering projects requiring massive energy output.",
      "Earth's fleet demonstrates the power of cooperation and coordinated action in cosmic affairs.",
      "Your patience and strategic thinking establish the doctrine of 'Collective Resonance' as humanity's preferred method for handling cosmic-scale challenges."
    ],
    "choices": []
  }

]
